apache/nuttx/arch/arm/src/imxrt/hardware/rt118x/imxrt118x_edma.h
/****************************************************************************
 * arch/arm/src/imxrt/hardware/rt118x/imxrt118x_edma.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_IMXRT_HARDWARE_RT118X_IMXRT118X_EDMA_H
#define __ARCH_ARM_SRC_IMXRT_HARDWARE_RT118X_IMXRT118X_EDMA_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdbool.h>
#include <stdint.h>

#include "hardware/imxrt_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define EDMA_CONFIG_SWSTART              (1 << 6) /* Start by software trigger */

/* eDMA3 / eDMA4 Register Offsets */

#define IMXRT_EDMA_CSR_OFFSET              (0x000000)              /* Management Page Control Register (CSR) */
#define IMXRT_EDMA_ES_OFFSET               (0x000004)              /* Management Page Error Status Register (ES) */
#define IMXRT_EDMA_CH_GRPRI_OFFSET(n)      (0x000100 + ((n) << 2)) /* Channel n Arbitration Group Register (CHn_GRPRI) */

/* eDMA3 only */

#define IMXRT_EDMA_INT_OFFSET              (0x000008) /* Management Page Interrupt Request Status Register (INT) */
#define IMXRT_EDMA_HRS_OFFSET              (0x00000c) /* Management Page Hardware Request Status Register (HRS) */

/* eDMA4 only */

#define IMXRT_EDMA_INT_LOW_OFFSET          (0x000008) /* Management Page Interrupt Request Status Register (INT_LOW) */
#define IMXRT_EDMA_INT_HIGH_OFFSET         (0x00000c) /* Management Page Interrupt Request Status Register (INT_HIGH) */
#define IMXRT_EDMA_HRS_LOW_OFFSET          (0x000010) /* Management Page Hardware Request Status Register (HRS_LOW) */
#define IMXRT_EDMA_HRS_HIGH_OFFSET         (0x000014) /* Management Page Hardware Request Status Register (HRS_HIGH) */

/* eDMA3 / eDMA4 Register Addresses */

#define IMXRT_EDMA_CSR(n)                  ((n) + IMXRT_EDMA_CSR_OFFSET)
#define IMXRT_EDMA_ES(n)                   ((n) + IMXRT_EDMA_ES_OFFSET)
#define IMXRT_EDMA_CH_GRPRI(n,c)           ((n) + IMXRT_EDMA_CH_GRPRI_OFFSET(c))

/* eDMA3 only */

#define IMXRT_EDMA_INT                     (IMXRT_DMA3_BASE + IMXRT_EDMA_INT_OFFSET)
#define IMXRT_EDMA_HRS                     (IMXRT_DMA3_BASE + IMXRT_EDMA_HRS_OFFSET)

/* eDMA4 only */

#define IMXRT_EDMA_INT_LOW                 (IMXRT_DMA4_BASE + IMXRT_EDMA_INT_LOW_OFFSET)
#define IMXRT_EDMA_INT_HIGH                (IMXRT_DMA4_BASE + IMXRT_EDMA_INT_HIGH_OFFSET)
#define IMXRT_EDMA_HRS_LOW                 (IMXRT_DMA4_BASE + IMXRT_EDMA_HRS_LOW_OFFSET)
#define IMXRT_EDMA_HRS_HIGH                (IMXRT_DMA4_BASE + IMXRT_EDMA_HRS_HIGH_OFFSET)

/* eDMA Transfer Control Descriptor (TCD) Register Offsets */

#define IMXRT_EDMA_CH_CSR_OFFSET           (0x000000) /* Channel Control and Status Register (CH0_CSR) */
#define IMXRT_EDMA_CH_ES_OFFSET            (0x000004) /* Channel Error Status Register (CH0_ES) */
#define IMXRT_EDMA_CH_INT_OFFSET           (0x000008) /* Channel Interrupt Status Register (CH0_INT) */
#define IMXRT_EDMA_CH_SBR_OFFSET           (0x00000c) /* Channel System Bus Register (CH0_SBR) */
#define IMXRT_EDMA_CH_PRI_OFFSET           (0x000010) /* Channel Priority Register (CH0_PRI) */
#define IMXRT_EDMA_CH_MUX_OFFSET           (0x000014) /* Channel Multiplexor Configuration (CH0_MUX) (eDMA4 only) */
#define IMXRT_EDMA_CH_MATTR_OFFSET         (0x000018) /* Memory Attributes Register (CH0_MATTR) (eDMA4 only) */
#define IMXRT_EDMA_TCD_SADDR_OFFSET        (0x000020) /* TCD Source Address Register (TCD0_SADDR) */
#define IMXRT_EDMA_TCD_SOFF_OFFSET         (0x000024) /* TCD Signed Source Address Offset Register (TCD0_SOFF) */
#define IMXRT_EDMA_TCD_ATTR_OFFSET         (0x000026) /* TCD Transfer Attributes (TCD0_ATTR) */
#define IMXRT_EDMA_TCD_NBYTES_OFFSET       (0x000028) /* TCD Transfer Size (TCD0_NBYTES) */
#define IMXRT_EDMA_TCD_SLAST_SDA_OFFSET    (0x00002c) /* TCD Last Source Address Adjustment / Store DADDR Address Register (TCD0_SLAST_SDA) */
#define IMXRT_EDMA_TCD_DADDR_OFFSET        (0x000030) /* TCD Destination Address Register (TCD0_DADDR) */
#define IMXRT_EDMA_TCD_DOFF_OFFSET         (0x000034) /* TCD Signed Destination Address Offset Register (TCD0_DOFF) */
#define IMXRT_EDMA_TCD_CITER_OFFSET        (0x000036) /* TCD Current Major Loop Count Register (TCD0_CITER) */
#define IMXRT_EDMA_TCD_DLAST_SGA_OFFSET    (0x000038) /* TCD Last Destination Address Adjustment / Scatter Gather Address Register (TCD0_DLAST_SGA)*/
#define IMXRT_EDMA_TCD_CSR_OFFSET          (0x00003c) /* TCD Control and Status Register (TCD0_CSR) */
#define IMXRT_EDMA_TCD_BITER_OFFSET        (0x00003e) /* TCD Beginning Major Loop Count Register (TCD0_BITER) */

/* eDMA 3 and eDMA 4 have TCD instance offsets, but same base offset */

#define IMXRT_EDMA_TCD_BASE_OFFSET         (0x10000) /* Offset to TCD for both eDMA3/4 */
#define IMXRT_EDMA3_TCD_INST_OFFSET        (0x10000) /* Per instance TCD offset for eDMA3 */
#define IMXRT_EDMA4_TCD_INST_OFFSET        (0x8000)  /* Per instance TCD offset for eDMA4 */
#define IMXRT_EDMA_TCD_BASE(n)             ((n) + IMXRT_EDMA_TCD_BASE_OFFSET)
#define IMXRT_EDMA_TCD_INST_OFFSET(n)      ((n) == IMXRT_DMA3_BASE ? IMXRT_EDMA3_TCD_INST_OFFSET : IMXRT_EDMA4_TCD_INST_OFFSET)
#define IMXRT_EDMA_TCD(n,t)                (IMXRT_EDMA_TCD_BASE(n) + (t) * IMXRT_EDMA_TCD_INST_OFFSET(n))

