apache/nuttx/arch/arm/src/imxrt/hardware/rt118x/imxrt118x_edma.h
/* Amount of channels */

#define DMA3_CHANNEL_COUNT                (32)
#define DMA4_CHANNEL_COUNT                (64)
#define IMXRT_EDMA_NCHANNELS              (DMA3_CHANNEL_COUNT + DMA4_CHANNEL_COUNT)

/* Amount of interrupt sources */

#define DMA3_IRQ_COUNT                    (32) /* Error interrupt not counted */
#define DMA4_IRQ_COUNT                    (16) /* Error interrupt not counted;
                                                * 4 channels share one IRQ */

/****************************************************************************
 * Public Types
 ****************************************************************************/

/* In-memory representation of the 32-byte Transfer Control Descriptor
 * (TCD)
 */

struct imxrt_edmatcd_s
{
  uint32_t   saddr;         /* Offset: 0x0000  TCD Source Address */
  uint16_t   soff;          /* Offset: 0x0004  TCD Signed Source Address Offset */
  uint16_t   attr;          /* Offset: 0x0006  TCD Transfer Attributes */
  uint32_t   nbytes;        /* Offset: 0x0008  TCD Signed Minor Loop Offset / Byte Count */
  uint32_t   slast;         /* Offset: 0x000c  TCD Last Source Address Adjustment */
  uint32_t   daddr;         /* Offset: 0x0010  TCD Destination Address */
  uint16_t   doff;          /* Offset: 0x0014  TCD Signed Destination Address Offset */
  uint16_t   citer;         /* Offset: 0x0016  TCD Current Minor Loop Link, Major Loop Count */
  uint32_t   dlastsga;      /* Offset: 0x0018  TCD Last Destination Address Adjustment/Scatter Gather Address */
  uint16_t   csr;           /* Offset: 0x001c  TCD Control and Status */
  uint16_t   biter;         /* Offset: 0x001e  TCD Beginning Minor Loop Link, Major Loop Count */
};

/****************************************************************************
 * Inline Functions
 ****************************************************************************/

/****************************************************************************
 * Name: imxrt_edma_tcdhasmux
 *
 * Description:
 *   Check if DMA TCD has TCD.MUX register.
 *
 * Input Parameters:
 *   dmabase - The eDMA base.
 *
 * Returned Value:
 *   true if TCD.MUX exists; false if not.
 *
 ****************************************************************************/

static inline bool imxrt_edma_tcdhasmux(uintptr_t dmabase)
{
  /* On RT1180 both eDMA3 and eDMA4 have per-channel CH_MUX registers. */

  return true;
}

/****************************************************************************
 * Name: imxrt_edma_choffset
 *
 * Description:
 *   Channel offset in global channel list for dma base.
 *
 * Input Parameters:
 *   base - The eDMA base.
 *
 * Returned Value:
 *   Channel offset.
 *
 ****************************************************************************/

static inline uint32_t imxrt_edma_choffset(uintptr_t base)
{
  return base == IMXRT_DMA3_BASE ? 0 : DMA3_CHANNEL_COUNT;
}

/****************************************************************************
 * Name: imxrt_edma_chmax
 *
 * Description:
 *   Max channel in global channel list for dma base.
 *
 * Input Parameters:
 *   base - The eDMA base.
 *
 * Returned Value:
 *   Channel max.
 *
 ****************************************************************************/

static inline uint32_t imxrt_edma_chmax(uintptr_t base)
{
  return base == IMXRT_DMA3_BASE ? DMA3_CHANNEL_COUNT : IMXRT_EDMA_NCHANNELS;
}

#endif /* __ARCH_ARM_SRC_IMXRT_HARDWARE_RT118X_IMXRT118X_EDMA_H */
